[
  {
    "id": 1,
    "title": "Freelancer",
    "company": "Upwork",
    "location": "Lagos, Nigeria",
    "duration": "April 2024 - Present",
    "description": [
      "Provided technical consulting and project management services, ensuring timely delivery and client satisfaction.",
      "Developed custom web applications for clients using React, Node.js, and MongoDB."
    ],
    "techStack": ["React.js", "Next.js", "Node.js", "JavaScript", "Solidity", "MongoDB", "TailwindCSS", "Railway"],
    "imageUrl": "/images/upwork.png"
  },
  {
    "id": 2,
    "title": "Junior Frontend Engineer",
    "company": "PayOnUs",
    "location": "Lagos, Nigeria",
    "duration": "January 2025 - Present",
    "description": [
      "Developed and implemented responsive user interfaces for the authentication system, including sign-up and login pages.",
      "Built an intuitive and responsive dashboard menu system improving overall user navigation and experience.",
      "Engineered a comprehensive KYC document management system with features for uploading, viewing, and managing documents.",
      "Implemented document preview functionality using react-doc-viewer, enabling users to view uploaded documents directly in the application.",
      "Collaborated with cross-functional teams to integrate frontend components with backend APIs and ensure seamless user experience.",
      "Contributed to sprint planning and daily stand-ups, actively participating in agile development processes."
    ],
    "techStack": ["HTML", "CSS", "JavaScript", "React.js"],
    "imageUrl": "/images/onusFavicon.png"
  },
  {
    "id": 3,
    "title": "Owner",
    "company": "NexTech Nomad",
    "location": "Lagos, Nigeria",
    "duration": "April 2024 - Present",
    "description": [
      "Founded and managed a tech agency specializing in innovative web and blockchain solutions, leading a dynamic team of developers to deliver cutting-edge projects.",
      "Collaborated with clients to understand their business needs and translated them into scalable, user-focused digital products.",
      "Provided end-to-end technical consulting, including architecture design, development, and deployment, ensuring optimal performance and client satisfaction.",
      "Designed and built custom web applications and decentralized solutions utilizing React, Node.js, and Solidity.",
      "Implemented best practices in agile development, ensuring timely delivery and maintaining a high standard of quality across all projects."
    ],
    "techStack": ["React.js", "Next.js", "Node.js", "JavaScript", "Solidity", "MongoDB", "TailwindCSS", "Railway"],
    "imageUrl": "/images/nextechnomad.png"
  }
]