[
  {
    "id": 1,
    "title": "FitTrackerPro",
    "description": "A comprehensive fitness tracking web application that helps users monitor their health metrics. This tool features a BMI (Body Mass Index) calculator and a daily calorie needs estimator. Users can input their weight, height, age, and gender to receive personalized health insights. The clean, user-friendly interface makes it easy for individuals to track their fitness progress and set informed health goals.",
    "techStack": [
      "React"
    ],
    "link": "https://fittrackerpro.vercel.app/",
    "imageUrl": "/images/tracker.png"
  },
  {
    "id": 2,
    "title": "Website Summarizer",
    "description": "A dynamic web application to summarize uploaded articles using OpenAI GPT-4 API.",
    "techStack": [
      "HTML",
      "CSS",
      "JavaScript",
      "Node.js",
      "Express",
      "OpenAI API"
    ],
    "link": "https://website-summarizer-9915f409eeb3.herokuapp.com/",
    "imageUrl": "/images/summarizer.png"
  },
  {
    "id": 3,
    "title": "Blockchain Farm",
    "description": "A decentralized application (DApp) that lets user farm X tokens and earn X tokens.",
    "techStack": [
      "Solidity",
      "Web3.js",
      "Next.js"
    ],
    "link": "https://v2testfarmbsc.netlify.app/",
    "imageUrl": "/images/farm.png"
  },
  {
    "id": 4,
    "title": "Recipe Finder",
    "description": "A dynamic web application that helps users discover new recipes based on ingredients, dietary preferences, and nutritional requirements. Leveraging the powerful Edamam API, this tool offers a vast database of recipes from around the world.",
    "techStack": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "link": "https://victorezcodes.github.io/recipe-finder-edamam/",
    "imageUrl": "/images/recipe.png"
  },
  {
    "id": 5,
    "title": "Codexchange",
    "description": "A pioneering decentralized platform revolutionizing the buying and selling of Web3/Web2 businesses. This innovative marketplace leverages blockchain technology to create a transparent, secure, and efficient environment for digital asset acquisitions.",
    "techStack": [
      "MongoDB",
      "Next.js",
      "Web3.js",
      "Solidity",
      "Express",
      "Node.js",
      "Telegram Bot"
    ],
    "link": "https://codexchange-833198fe44cb.herokuapp.com/",
    "imageUrl": "/images/codexchange.png"
  },
  {
    "id": 6,
    "title": "Voice-Controlled Web App",
    "description": "This innovative web application leverages cutting-edge voice recognition technology to create an interactive, hands-free user experience. Built with JavaScript and powered by various APIs, including OpenAI's GPT-3.5-turbo, the app can understand and respond to voice commands, providing a wide range of functionalities",
    "techStack": [
      "HTML",
      "CSS",
      "JavaScript",
      "OpenAI API",
      "ResponsiveVoice API",
      "Express",
      "Node.js",
      "OpenWeatherMap API",
      "API Ninjas",
      "Wit.ai"
    ],
    "link": "https://voice-controlled-ai-web-app-40359552662b.herokuapp.com/",
    "imageUrl": "/images/voice_web_app.png"
  },
  {
    "id": 7,
    "title": "OptiPic",
    "description": "OptiPic is a powerful, user-friendly web application designed for efficient bulk image compression. This tool allows users to optimize multiple images simultaneously, significantly reducing file sizes while maintaining image quality. Perfect for photographers, web developers, and content creators who need to manage and optimize large image libraries quickly and easily.",
    "techStack": [
      "Next.js",
      "Tailwind CSS",
      "Node.js"
    ],
    "link": "https://optipic.vercel.app/",
    "imageUrl": "/images/optipic.png"
  },
  {
    "id": 8,
    "title": "Split The Bill",
    "description": "SplitTheBill is a web application designed to simplify the process of splitting bills among friends, roommates, or colleagues. It offers an intuitive interface for managing shared expenses with percentage-based splitting capabilities.",
    "techStack": [
      "Next.js",
      "Tailwind CSS",
      "TypeScript"
    ],
    "link": "https://thebillsplitterweb.netlify.app",
    "imageUrl": "/images/bill.png"
  },
  {
    "id": 9,
    "title": "BouncerLink",
    "description": "BouncerLink is a sophisticated URL shortening service offering advanced link management features such as link expiration, access control via password or email, click limiting, analytics dashboard for tracking performance, email notifications, and the ability to create custom short URLs for personalized sharing.",
    "techStack": [
      "Next.js",
      "Tailwind CSS",
      "TypeScript",
      "PostgreSQL with Prisma ORM",
      "NextAuth.js"
    ],
    "link": "https://bouncerlink.netlify.app/",
    "imageUrl": "/images/bouncerlink.png"
  },
  {
    "id": 10,
    "title": "ProCompress",
    "description": "ProCompress is a cutting-edge image compression tool designed to optimize image sizes, enhance website performance, and reduce bandwidth usage. This innovative web application leverages the latest compression algorithms and user-friendly interfaces to deliver fast, efficient image optimization solutions.",
    "techStack": [
      "React",
      "Tailwind CSS",
      "MongoDB",
      "Google OAuth",
      "Node.js"
    ],
    "link": "https://procompress.xyz/",
    "imageUrl": "/images/procompress.png"
  },
  {
    "id": 11,
    "title": "FashionHub",
    "description": "This project is a full-stack e-commerce platform for a clothing shop. It features a React-based frontend and a Node.js/Express backend, with MongoDB as the database. The application allows users to browse products, add items to their cart, place orders, and includes an admin panel for managing products and orders.",
    "techStack": [
      "React",
      "Tailwind CSS",
      "MongoDB",
      "Framer Motion",
      "Node.js"
    ],
    "link": "https://ecommclothingshop.netlify.app",
    "imageUrl": "/images/fashionhub.png"
  },
  {
    "id": 12,
    "title": "SmartFitPlan",
    "description": "SmartFitPlan is a Next.js-based web application that leverages artificial intelligence to create personalized workout plans and provide nutrition advice tailored to your fitness goals.",
    "techStack": [
      "React",
      "Tailwind CSS",
      "MongoDB",
      "Framer Motion",
      "Next.js",
      "Clerk",
      "MongoDB",
      "RapidAPI"
    ],
    "link": "https://smartfitplan.xyz/",
    "imageUrl": "/images/smartfitplan.png"
  },
  {
    "id": 13,
    "title": "Mood Tracker Application V1",
    "description": "The Mood Tracker is a web application designed to help users log and visualize their daily moods. Users can select from a set of predefined mood emojis or add custom emojis to represent their feelings. The application allows users to add notes to their mood entries, view a history of their moods, and visualize mood trends over time using a chart. Additionally, users can export their mood data as a JSON file for personal records. The application supports both light and dark themes for a personalized user experience.",
    "techStack": [
      "HTML",
      "JavaScript",
      "Chart.js",
      "LocalStorage",
      "ES6 Modules"
    ],
    "link": "https://trackmoods.netlify.app/",
    "imageUrl": "/images/mood_tracker.png"
  },
  {
    "id": 14,
    "title": "Mood Tracker Application V2",
    "description": "An advanced mood tracking web application that helps users monitor their emotional well-being with AI-powered insights. The app features a clean, responsive interface for logging daily moods using emojis, along with journal entries and tags. Key features include personalized AI emotional support, detailed mood analytics showing patterns and trends, tag-based mood correlation insights, and an interactive chart displaying mood history. The application prioritizes user privacy by storing all data locally, while offering a sophisticated dark/light theme system and mobile-first design.",
    "techStack": [
      "JavaScript (ES6+)",
      "Chart.js",
      "OpenAI API",
      "Tailwind CSS",
      "LocalStorage",
      "HTML5"
    ],
    "link": "https://advancedmoodtracker.netlify.app/",
    "imageUrl": "/images/mood_tracker_2.png"
  },
  {
    "id": 15,
    "title": "Code Documentation Assistant",
    "description": "A powerful web application that automates the creation of comprehensive documentation for GitHub repositories. Built with GPT-4 Turbo, this tool analyzes repository content and generates detailed README files with API references, changelogs, and implementation details. Features include dark/light theme support, real-time markdown preview, intelligent repository scanning, and a user-friendly interface for seamless documentation generation. Perfect for developers looking to maintain high-quality documentation with minimal effort.",
    "techStack": [
      "JavaScript",
      "Vite",
      "Tailwind CSS",
      "OpenAI API",
      "GitHub API"
    ],
    "link": "https://documentationassistant.netlify.app/",
    "imageUrl": "/images/code_doc_assistant.png"
  }
]